
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьНадписьМесяцаПланирования();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(МесяцПланирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан месяц планирования",,"МесяцПланирования");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбораПериода = Новый Структура("НачалоПериода,КонецПериода,ВыборКварталов",
	Объект.НачалоПериода, Объект.КонецПериода, Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц",
		ПараметрыВыбораПериода, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	УстановитьНадписьМесяцаПланирования();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьМесяцаПланирования()
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		МесяцПланирования = Строка(Формат(Объект.НачалоПериода, "ДФ='MMMM yyyy';"));
	Иначе
		МесяцПланирования = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

