
#Область ПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ЗаписатьДанныеСеанса();
	
	ПриУстановкеПараметровФункциональныхОпцийИнтерфейса();
	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраПриложения(ИмяПараметра, ЗначениеПараметра) Экспорт
	
   Если ПараметрыПриложения.Получить(ИмяПараметра) = Неопределено Тогда
     ПараметрыПриложения.Вставить(ИмяПараметра, ЗначениеПараметра);
   КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметраПриложения(ИмяПараметра) Экспорт
	
	ЗначениеПараметра = ПараметрыПриложения.Получить(ИмяПараметра);
	
	Возврат ЗначениеПараметра;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДанныеСеанса()
		
	ДанныеСеанса = Новый Структура;
	ДанныеСеанса.Вставить("ДатаНачалаСеанса", ТекущаяДата());
		
	#Если МобильныйКлиент ИЛИ МобильноеПриложениеКлиент Тогда
	ИспользуетсяМобильныйИнтерфейс = Истина;
	#Иначе
	ИспользуетсяМобильныйИнтерфейс = Ложь;
	#КонецЕсли

	ДанныеСеанса.Вставить("ИспользуетсяМобильныйИнтерфейс", ИспользуетсяМобильныйИнтерфейс);
	ДанныеСеанса.Вставить("ИспользуетсяПолнофункциональныйИнтерфейс", НЕ ИспользуетсяМобильныйИнтерфейс);
	
	СтандартныеПодсистемыВызовСервера.ЗаписатьДанныеСеанса(ДанныеСеанса);	
	
	УстановитьЗначениеПараметраПриложения("НомерСеанса", ДанныеСеанса.НомерСеанса);
	УстановитьЗначениеПараметраПриложения("МобильныйИнтерфейс", ИспользуетсяМобильныйИнтерфейс);
	
КонецПроцедуры

Процедура ПриУстановкеПараметровФункциональныхОпцийИнтерфейса()
	
	СтруктураПараметров = Новый Структура("ВариантИнтерфейса", ПолучитьЗначениеПараметраПриложения("НомерСеанса"));
	
	УстановитьПараметрыФункциональныхОпцийИнтерфейса(СтруктураПараметров);
	
КонецПроцедуры 

#КонецОбласти