Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.РегистрацияДоходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.РегистрацияДоходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.РегистрацияДоходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.РегистрацияДоходов.ОтразитьДвиженияДоходы(ЭтотОбъект, Отказ);

КонецПроцедуры