
#Область ПрограммныйИнтерфейс

Процедура ОткрытьПрисоединенныйФайл(ПрисоединенныйФайл) Экспорт

	ДанныеФайла = ПрисоединенныеФайлыВызовСервера.ДанныеПрисоединенногоФайла(ПрисоединенныйФайл);
	
	#Если ВебКлиент Тогда
	ИмяВременногоФайла = Строка(Новый УникальныйИдентификатор) + ДанныеФайла.Расширение;
 	#Иначе
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
	#КонецЕсли
	
	ПолноеИмяВременногоФайла = КаталогВременныхФайлов() + ИмяВременногоФайла;
	
	ДвоичныеДанные = ДанныеФайла.ДвоичныеДанные;
	
	ДвоичныеДанные.Записать(ПолноеИмяВременногоФайла);
	
	ЗапуститьПриложение(ПолноеИмяВременногоФайла);

КонецПроцедуры

#КонецОбласти