
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДляВызоваИзДругихПодсистем

Процедура ЗаполнитьВалютуВДвижениях() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Регистратор
	|ИЗ
	|	РегистрНакопления.мх_ДоходыРасходы КАК Таблица";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВалютаПоУмолчанию = мх_КошелькиИСчета.ВалютаПоУмолчанию();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.мх_ДоходыРасходы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		Для каждого Запись из НаборЗаписей Цикл		
			Запись.Валюта = ВалютаПоУмолчанию;	
		КонецЦикла;
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти	
		
#КонецЕсли