
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВнешняяСистема") Тогда
		Объект.ВнешняяСистема = Параметры.ВнешняяСистема;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыполнитьАвторизацию(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Ждать мх_ИнтеграцияТинькоффКлиент.ВыполнитьАвторизациюВЛичномКабинете(Объект.ВнешняяСистема);
	
	Если НЕ Результат.Успех Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

