

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПрочитатьЗначенияКонстант();

КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначенияКонстант()
	
	КонстантыНастройки = КонстантыНастройки();
	
	Набор = Константы.СоздатьНабор(КонстантыНастройки);
	Набор.Прочитать();
	
	Для каждого Константа из КонстантыНастройки Цикл
		
		КонстантыДляНастройки[Константа.Имя] = Набор[Константа.Имя];		
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияКонстант()
	
	КонстантыНастройки = КонстантыНастройки();
	
	Набор = Константы.СоздатьНабор(КонстантыНастройки);
	
	Для каждого Константа из КонстантыНастройки Цикл
		
		Набор[Константа.Имя] = КонстантыДляНастройки[Константа.Имя];		
		
	КонецЦикла;
	
	Набор.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	ПрименитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройкиНаСервере()
	ЗаписатьЗначенияКонстант();
КонецПроцедуры


&НаСервереБезКонтекста
Функция КонстантыНастройки()
	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить(Метаданные.Константы.ИспользоватьПланированиеБюджета);
	МассивИмен.Добавить(Метаданные.Константы.СистемаПроверкиЧеков);
	
	Возврат МассивИмен;
	
КонецФункции