
#Область ПрограммныйИнтерфейс

Функция НомерТекущегоСеанса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.НомерСеанса;
	
КонецФункции

Функция ДанныеТекущегоСеанса(Знач НомерСеанса = Неопределено) Экспорт
	
	Если НомерСеанса = Неопределено Тогда
		НомерСеанса = НомерТекущегоСеанса();
	КонецЕсли;
	
	Возврат РегистрыСведений.ДанныеСеансовИнформационнойБазы.ДанныеСеанса(НомерСеанса);
	
КонецФункции

Функция ИспользуетсяМобильныйИнтерфейс(Знач НомерСеанса = Неопределено) Экспорт
	
	Если НомерСеанса = Неопределено Тогда
		НомерСеанса = НомерТекущегоСеанса();
	КонецЕсли;
		
	ДанныеСеанса = ДанныеТекущегоСеанса(НомерСеанса);
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	ИспользуетсяМобильныйИнтерфейс = ТипБулево.ПривестиЗначение(ДанныеСеанса.ИспользуетсяМобильныйИнтерфейс);
	
	Возврат ИспользуетсяМобильныйИнтерфейс;	
	
КонецФункции

#КонецОбласти