#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТипыКошельковСобственныхСредств() Экспорт

	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.БанковскийСчет"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.ДебетоваяБанковскаяКарта"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.Наличность"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.ЭлектронныйКошелек"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКошельковИСчетов.КредитнаяБанковскаяКарта"));
	
	Возврат МассивТипов;
	
КонецФункции		

#КонецЕсли