#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыДокументаПоШаблону(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти(ЭтотОбъект,
																		"Доходы",
																		"Кошелек, СтатьяДоходов, АналитикаДоходов, ДатаОперации, ВнеплановыйДоход",
																		"Сумма");
	
	ЗаполнитьРеквизитыСумм();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.мх_РегистрацияДоходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияДоходы(ЭтотОбъект, Отказ);
	Документы.мх_РегистрацияДоходов.ОтразитьДвиженияПланированиеБюджета(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыСумм()

	ЭтотОбъект.Сумма = Доходы.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#КонецЕсли