
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПараметрыПользователя") Тогда
		
		Если ЭтоНовый() Тогда
			ИдентификаторПользователяИБ = Пользователи.СоздатьПользователяИнформационнойБазы(
														ДополнительныеСвойства.ПараметрыПользователя);
		Иначе
			Пользователи.ОбновитьПользователяИнформационнойБазы(ДополнительныеСвойства.ПараметрыПользователя);		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
