
#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыКошельковСобственныхСредств() Экспорт
	
	Возврат Перечисления.мх_ТипыКошельковИСчетов.ТипыКошельковСобственныхСредств();
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	Возврат Перечисления.мх_ТипыКошельковИСчетов.ТипыКошельковЗаемныхСредств();
	
КонецФункции

Функция ВалютаПоУмолчанию() Экспорт
	
	ВалютаПоУмолчанию = Константы.мх_ВалютаПоУмолчанию.Получить();
	
	Если НЕ ЗначениеЗаполнено(ВалютаПоУмолчанию) Тогда
		ВалютаПоУмолчанию = мх_КошелькиИСчета.СоздатьВалютуПоУмолчанию();
		Константы.мх_ВалютаПоУмолчанию.Установить(ВалютаПоУмолчанию);	
	КонецЕсли;
	
	Возврат ВалютаПоУмолчанию;
	
КонецФункции

Функция ВалютаКошелька(Знач Кошелек) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кошелек, "Валюта");
	
КонецФункции

#КонецОбласти