#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДвиженияДокумента

Функция ТаблицаДвиженийСтатистикаУпражнений(Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Упражнения.Ссылка КАК Регистратор,
	|	РегистрацияФизическихУпражений.Дата КАК Период,
	|	Упражнения.Ссылка.Ответственный КАК Пользователь,
	|	Упражнения.Упражнение,
	|	Упражнения.Показатель,
	|	Упражнения.Количество
	|ИЗ
	|	Документ.мх_РегистрацияФизическихУпражений.ФизическиеУпражения КАК Упражнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.мх_РегистрацияФизическихУпражений КАК РегистрацияФизическихУпражений
	|		ПО Упражнения.Ссылка = РегистрацияФизическихУпражений.Ссылка
	|ГДЕ
	|	Упражнения.Ссылка = &Ссылка";

	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции

Процедура ОтразитьДвиженияСтатистикаУпражненийЭкспорт(Ссылка, Движения, Отказ) Экспорт

	ТаблицаУпражнения = ТаблицаДвиженийСтатистикаУпражнений(Ссылка);

	Если Отказ Или ТаблицаУпражнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвиженияУпражнения = Движения.мх_СтатистикаФизическихУпражнений;
	ДвиженияУпражнения.Записывать = Истина;
	ДвиженияУпражнения.Загрузить(ТаблицаУпражнения);

КонецПроцедуры

#КонецОбласти

#КонецЕсли