
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ВозвратРасходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.ВозвратРасходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.ВозвратРасходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.ВозвратРасходов.ОтразитьДвиженияРасходы(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияРасходов") Тогда
		ЗаполнитьПоДокументуРасхода(ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти()
	
	ЭтотОбъект.Сумма = Расходы.Итог("Сумма");
	
	ДокументыРасхода = ЭтотОбъект.Расходы.Выгрузить();
	ДокументыРасхода.Свернуть("ДокументРасхода");
	
	Если ДокументыРасхода.Количество() = 1 Тогда
		ЭтотОбъект.ДокументРасхода = ДокументыРасхода[0].ДокументРасхода;
	Иначе
		ЭтотОбъект.ДокументРасхода = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуРасхода(ДокументРасхода)
	
	ТаблицаРасходов = Документы.ВозвратРасходов.ТаблицаРасходовПоДокументамРасхода(ДокументРасхода);
	
	ЭтотОбъект.Расходы.Загрузить(ТаблицаРасходов);
	
КонецПроцедуры

#КонецОбласти



