
#Область СлужебныйПрограммныйИнтерфейс

// Имена форм начальной страницы.
// 
// Возвращаемое значение:
//  Массив - Имена форм начальной страницы
Функция ИменаФормНачальнойСтраницы() Экспорт
	
	МассивИмен = Новый Массив;
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	СоставФорм = НачальнаяСтраница.ПолучитьСоставФорм();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивИмен, СоставФорм.ЛеваяКолонка);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивИмен, СоставФорм.ПраваяКолонка);
	
	Возврат МассивИмен;	
	
КонецФункции

#КонецОбласти