#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ДляВызоваИзДругихПодсистем

Процедура ЗаполнитьТипНоменклатурыПоУмолчанию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мх_Номенклатура.Ссылка
	|ИЗ
	|	Справочник.мх_Номенклатура КАК мх_Номенклатура
	|ГДЕ
	|	НЕ мх_Номенклатура.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипПоУмолчанию = Перечисления.мх_ТипыНоменклатуры.Товар;
	
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.Тип = ТипПоУмолчанию;
		Объект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти	

#КонецЕсли