#Область ПрограммныйИнтерфейс

Функция ОстатокКошелька(Кошелек, Период = Неопределено) Экспорт

	Если Период = Неопределено Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = Период;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Остатки(&ДатаСреза, Кошелек = &Кошелек) КАК ДвиженияДенежныхСредствОстатки";

	Выборка = Запрос.Выполнить().Выбрать();

	Баланс = 0;

	Если Выборка.Следующий() Тогда
		Баланс = Выборка.СуммаОстаток;
	КонецЕсли;

	Возврат Баланс;

КонецФункции

Функция ОстаткиКошельков(Кошельки, Период = Неопределено, ВСоответствие = Истина) Экспорт

	Если Период = Неопределено Тогда
		ДатаСреза = ТекущаяДата();
	Иначе
		ДатаСреза = Период;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Кошельки", Кошельки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОстатки.Кошелек,
	|	ДвиженияДенежныхСредствОстатки.СуммаОстаток КАК Баланс
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Остатки(&ДатаСреза, Кошелек В (&Кошельки)) КАК
	|		ДвиженияДенежныхСредствОстатки
	|УПОРЯДОЧИТЬ ПО
	|	ДвиженияДенежныхСредствОстатки.Кошелек.Наименование УБЫВ";

	ТаблицаДанных = Запрос.Выполнить().Выгрузить();

	Результат = ТаблицаДанных;

	Если ВСоответствие Тогда

		Результат = Новый Соответствие;

		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Результат.Вставить(СтрокаТаблицы.Кошелек, СтрокаТаблицы.Баланс);
		КонецЦикла;

	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция КошелькиДляОтображенияНаРабочемСтоле() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КошелькиИСчета.Ссылка КАК Кошелек
	|ИЗ
	|	Справочник.КошелькиИСчета КАК КошелькиИСчета
	|ГДЕ
	|	НЕ КошелькиИСчета.ПометкаУдаления
	|	И КошелькиИСчета.ОтображатьОстатокНаРабочемСтоле
	|УПОРЯДОЧИТЬ ПО
	|	КошелькиИСчета.Наименование";

	Кошельки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кошелек");

	Возврат Кошельки;

КонецФункции

#КонецОбласти