#Область ПрограммныйИнтерфейс

Функция СоздатьПользователяИнформационнойБазы(ПараметрыПользователя) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	ЗаполнитьЗначенияСвойств(Пользователь, ПараметрыПользователя);

	Пользователь.Роли.Очистить();
	Для Каждого ИмяРоли Из ПараметрыПользователя.Роли Цикл
		Пользователь.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
	КонецЦикла;

	Пользователь.Записать();

	Возврат Пользователь.УникальныйИдентификатор;

КонецФункции

Процедура ОбновитьПользователяИнформационнойБазы(ПараметрыПользователя) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
													ПараметрыПользователя.ИдентификаторПользователяИБ);

	ЗаполнитьЗначенияСвойств(Пользователь, ПараметрыПользователя, , "Роли");
	Пользователь.Роли.Очистить();
	Для Каждого ИмяРоли Из ПараметрыПользователя.Роли Цикл
		Пользователь.Роли.Добавить(Метаданные.Роли[ИмяРоли]);
	КонецЦикла;

	Пользователь.Записать();

КонецПроцедуры

Функция ТекущийПользователь() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Возврат ПараметрыСеанса.ТекущийПользователь;

КонецФункции

#КонецОбласти