#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыДокументаПоШаблону(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	мх_ОбработчикиСобытий.ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти(ЭтотОбъект,
																		"Лекарства",
																		"Номенклатура, Единица",
																		"Количество");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.мх_РасходЛекарств.ЗаблокироватьДанныеПередРегистрациейДвижений(ЭтотОбъект);

	Документы.мх_РасходЛекарств.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_РасходЛекарств.ОтразитьДвиженияЛекарства(ЭтотОбъект, Отказ);
	
	Документы.мх_РасходЛекарств.КонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли