
#Область ПрограммныйИнтерфейс

Функция ПредставлениеСуммы(Знач Сумма, Валюта = "", ВыделятьЦветом = Ложь) Экспорт
	
	БалансСтрокой = Строка(Сумма);
	
	Если НЕ ПустаяСтрока(Валюта) Тогда
		БалансСтрокой = БалансСтрокой + " " + Валюта;
	КонецЕсли;
	
	Если ВыделятьЦветом Тогда
		
		Если Сумма > 0 Тогда
			ЦветСуммы = ЦветаСтиля.ЦветПоложительнаяСумма;
		ИначеЕсли Сумма < 0 Тогда
			ЦветСуммы = ЦветаСтиля.ЦветОтрицательнаяСумма;
		Иначе
			ЦветСуммы = Новый Цвет();
		КонецЕсли;
		
	Иначе
		
		ЦветСуммы = Новый Цвет();
		
	КонецЕсли;
	
	Представление = Новый ФорматированнаяСтрока(БалансСтрокой, , ЦветСуммы, , );
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти