
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокДоступныхТипов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипАналитикиПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДоступныеТипы.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьТипАналитикиПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	ОбновитьСписокДоступныхТипов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ВыбратьТипАналитикиПоУмолчанию()
	
	ВыбранноеЗначение = Ждать ДоступныеТипы.ВыбратьЭлементАсинх();
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ВыбранныйТип = ВыбранноеЗначение.Значение;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ВыбранныйТип);
	
	ТипАналитикиПоУмолчаниюПредставление = Строка(ВыбранныйТип);
	
	ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
	Объект.ТипАналитикиПоУмолчанию = ОписаниеТипа.ПривестиЗначение(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокДоступныхТипов()
	
	МассивТипов = Объект.ТипЗначения.Типы();
	
	ДоступныеТипы.ЗагрузитьЗначения(МассивТипов);
	
	Если МассивТипов.Количество() > 0 
		И ПустаяСтрока(ТипАналитикиПоУмолчаниюПредставление) Тогда
		ТипАналитикиПоУмолчаниюПредставление = Строка(МассивТипов[0]);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти





