#Область ПрограммныйИнтерфейс

Процедура ДоходыРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) Экспорт
	
	ЗаполнитьДатуОперации(Элемент, НоваяСтрока, Копирование);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДатуОперации(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ Элемент.ТекущиеДанные.Свойство("ДатаОперации") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаОперации) Тогда
		Элемент.ТекущиеДанные.ДатаОперации = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти