#Область ПрограммныйИнтерфейс

Процедура ОткрытьПрисоединенныйФайл(ПрисоединенныйФайл) Экспорт

	ДанныеФайла = ПрисоединенныеФайлыВызовСервера.ДанныеПрисоединенногоФайла(ПрисоединенныйФайл);

#Если ВебКлиент Тогда
	ИмяВременногоФайла = Строка(Новый УникальныйИдентификатор) + ДанныеФайла.Расширение;
	ПолноеИмяВременногоФайла = КаталогВременныхФайлов() + ИмяВременногоФайла;
#Иначе
		ПолноеИмяВременногоФайла = ПолучитьИмяВременногоФайла(ДанныеФайла.Расширение);
#КонецЕсли

	ДвоичныеДанные = ДанныеФайла.ДвоичныеДанные;

	ДвоичныеДанные.Записать(ПолноеИмяВременногоФайла);

	ЗапуститьПриложение(ПолноеИмяВременногоФайла);

КонецПроцедуры

Процедура УдалитьПрисоединенныйФайл(ПрисоединенныйФайл) Экспорт

	ПрисоединенныеФайлыВызовСервера.УдалитьПрисоединенныйФайл(ПрисоединенныйФайл);

КонецПроцедуры

#КонецОбласти