#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	ОбработчикиСобытийДокументов.ЗаполнитьРеквизитыДокументаПоШаблону(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ОбработчикиСобытийДокументов.ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти(	ЭтотОбъект,
																				"Перемещения",
																				"КошелекОткуда, КошелекКуда",
																				"Сумма");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.мх_ПеремещениеДенежныхСредств.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.мх_ПеремещениеДенежныхСредств.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти

#КонецЕсли