
#Область ПрограммныйИнтерфейс

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	//  имя конфигурации и номер версии на
	Описание.Имя = "MyHome";
	Описание.Версия = "0.0.3.0";
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик					 = Обработчики.Добавить();
	Обработчик.Версия			 = "0.0.3.0";
	Обработчик.Процедура		 = "ОбновлениеИнформационнойБазыMyHome.ПерейтиНаВерсию_0_0_3_0";
	Обработчик.РежимВыполнения	 = "Монопольно";
	
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПерейтиНаВерсию_0_0_3_0() Экспорт
	
	ПерезаполнитьРеквизитыПрисоединенныхФайлов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерезаполнитьРеквизитыПрисоединенныхФайлов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГарантияПрисоединенныеФайлы.Ссылка КАК СсылкаНаФайл
	|ИЗ
	|	Справочник.ГарантияПрисоединенныеФайлы КАК ГарантияПрисоединенныеФайлы
	|ГДЕ
	|	ГарантияПрисоединенныеФайлы.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаПереноса = ТекущаяДата();
	ТипХранения = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе");
	Автор = Пользователи.ТекущийПользователь();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			ФайлОбъект								 = Выборка.СсылкаНаФайл.ПолучитьОбъект();
			ФайлОбъект.ОбменДанными.Загрузка		 = Истина;
			ФайлОбъект.Автор						 = Автор;
			ФайлОбъект.ДатаСоздания					 = ДатаПереноса;
			ФайлОбъект.ТипХраненияФайла				 = ТипХранения;
			ФайлОбъект.ДатаМодификацииУниверсальная	 = ДатаПереноса;

			ДанныеХранилища							 = ФайлОбъект.Удалить_ХранилищеФайла.Получить();
			ФайлОбъект.ФайлХранилище				 = Новый ХранилищеЗначения(ДанныеХранилища);

			ФайлОбъект.Расширение					 = СтрЗаменить(ФайлОбъект.Удалить_Расширение, ".", "");
			ФайлОбъект.ИндексКартинки				 = РаботаСФайламиСлужебныйКлиентСервер.ПолучитьИндексПиктограммыФайла(ФайлОбъект.Расширение);
			ФайлОбъект.Записать();

			МенеджерЗаписи						 = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Файл					 = ФайлОбъект.Ссылка;
			МенеджерЗаписи.ДвоичныеДанныеФайла	 = Новый ХранилищеЗначения(ДанныеХранилища);
			МенеджерЗаписи.Записать();

			НаличиеФайлов						 = РегистрыСведений.НаличиеФайлов.СоздатьМенеджерЗаписи();
			НаличиеФайлов.ОбъектСФайлами		 = ФайлОбъект.ВладелецФайла;
			НаличиеФайлов.ЕстьФайлы				 = Истина;
			НаличиеФайлов.Записать();		
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
