

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	мх_СобытияФормКлиент.ДоходыРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура РасходыСтатьяРасходовПриИзменении(Элемент)
	РасходыСтатьяРасходовПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасходыСтатьяРасходовПриИзмененииНаСервере()
	ЗаполнитьРеквизитыСтрокиРасходаПоСтатье()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиРасходаПоСтатье()

		
	ИдентификаторСтроки = Элементы.Расходы.ТекущаяСтрока;

	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Объект.Расходы.НайтиПоИдентификатору(ИдентификаторСтроки);
	мх_СобытияФорм.ЗаполнитьРеквизитыСтрокиДоходаРасходаПоСтатье(ДанныеСтроки, ДанныеСтроки.СтатьяРасходов);
	 
КонецПроцедуры

#КонецОбласти

