
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВладелецФайлов) Тогда
		ВладелецФайлов = Параметры.ВладелецФайлов;
	Иначе
		Отказ = Истина;
		Сообщить("Форма предназначена только для открытия из формы владельца файлов")
	КонецЕсли;
	
	ИзменитьТекстЗапросаДинамическогоСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
  Оповещение = Новый ОписаниеОповещения("ВыбратьФайлПослеПомещенияФайла", ЭтотОбъект);
  ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
  ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
  ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки,,АдресВременногоХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

&НаКлиенте
Процедура ВыбратьФайлПослеПомещенияФайла(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Вставить("ВладелецФайла", ВладелецФайлов);
	
	ПрисоединенныеФайлыВызовСервера.СоздатьПрисоединенныйФайл(Результат);
		
	Элементы.Список.Обновить();	
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьТекстЗапросаДинамическогоСписка()
	
	ИмяВладельца = ВладелецФайлов.Метаданные().Имя;
	ПолноеИмяПодчиненногоСправочника = "Справочник." + ИмяВладельца + "ПрисоединенныеФайлы";
	
	ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "&ТаблицаФайлов", ПолноеИмяПодчиненногоСправочника);
	
	Список.ТекстЗапроса = ТекстЗапроса;
	Список.Параметры.УстановитьЗначениеПараметра("ВладелецФайла", ВладелецФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
	
	ПрисоединенныеФайлыКлиент.ОткрытьПрисоединенныйФайл(ДанныеСтроки.Ссылка);
	
КонецПроцедуры


#КонецОбласти
