#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ДобавитьЗаписьЖурналаРегистрации(ПараметрыЗаписи) Экспорт
	
	Запись = РегистрыСведений.мх_ЖурналСообщенийИнтеграции.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор());
	Запись.ДатаЗапросаУниверсальная = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.ДатаЗапроса = Дата(1,1,1) + Запись.ДатаЗапросаУниверсальная / 1000;
	
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписи);
	
	Запись.Записать();
	
КонецПроцедуры
		
#КонецЕсли