#Область ПрограммныйИнтерфейс

Функция НовыеПараметрыПользователяИнформационнойБазы(ДанныеПользователя = Неопределено, Роли = Неопределено) Экспорт

	ПараметрыПользователя = Новый Структура;
	ПараметрыПользователя.Вставить("Имя", "");
	ПараметрыПользователя.Вставить("ПолноеИмя", "");
	ПараметрыПользователя.Вставить("ИдентификаторПользователяИБ", "");
	ПараметрыПользователя.Вставить("Роли", Новый Массив);

	Если ДанныеПользователя <> Неопределено Тогда

		ПараметрыПользователя.Имя		 = ДанныеПользователя.Код;
		ПараметрыПользователя.ПолноеИмя	 = ДанныеПользователя.Наименование;

		Для Каждого РольПользователя Из Роли Цикл
			Если РольПользователя.Пометка Тогда
				ПараметрыПользователя.Роли.Добавить(РольПользователя.Значение);
			КонецЕсли;
		КонецЦикла;

		ЗаполнитьЗначенияСвойств(ПараметрыПользователя, ДанныеПользователя);

	КонецЕсли;

	Возврат ПараметрыПользователя;

КонецФункции

#КонецОбласти