#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТипыКошельковСобственныхСредств() Экспорт

	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.БанковскийСчет"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.ДебетоваяБанковскаяКарта"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.Наличность"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.ЭлектронныйКошелек"));
	
	Возврат МассивТипов;
	
КонецФункции

Функция ТипыКошельковЗаемныхСредств() Экспорт
	
	МассивТипов = Новый Массив;
	
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.мх_ТипыКошельковИСчетов.КредитнаяБанковскаяКарта"));
	
	Возврат МассивТипов;
	
КонецФункции		

#КонецЕсли