#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодОтчета = Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтотМесяц);

	ВсегоРасходовЗаМесяц = СуммаРасходаЗаПериод(ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);	
	
	УстановитьОформлениеЭлементов();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьРасходЗаМесяц(Команда)
	ВсегоРасходовЗаМесяц = СуммаРасходаЗаПериод(ПериодОтчета.ДатаНачала, ПериодОтчета.ДатаОкончания);
	УстановитьОформлениеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАнализРасходовНажатие(Элемент)
	
	ПараметрыДанных = Новый Структура("ПериодОтчета", ПериодОтчета);
	ПользовательскиеНастройки = УстановитьНастройкиОтчета("АнализРасходов", ПараметрыДанных, Неопределено);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	ОткрытьФорму("Отчет.АнализРасходов.Форма", ПараметрыОтчета);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция УстановитьНастройкиОтчета(ИмяОтчета, ПараметрыДанных, Отборы)
	
	Настройки = КомпоновкаДанныхСервер.УстановитьНастройкиОтчета(ИмяОтчета, ПараметрыДанных, Отборы);
	
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммаРасходаЗаПериод(ДатаНачала, ДатаОкончания)
	
	СуммаРасхода = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.Расходы.Обороты(&ДатаНачала, &ДатаОкончания,,) КАК РасходыОбороты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаРасхода = Выборка.СуммаОборот;
	КонецЕсли;
	
	Возврат СуммаРасхода;
	
КонецФункции

&НаСервере
Процедура УстановитьОформлениеЭлементов()
	
	ДлинаЧислаРасходы = СтрДлина(Строка(ВсегоРасходовЗаМесяц));
	РасчетнаяШирина = ДлинаЧислаРасходы * 1.5;
	Элементы.ВсегоРасходовЗаМесяц.Ширина = Мин(РасчетнаяШирина, Элементы.ВсегоРасходовЗаМесяц.МаксимальнаяШирина);
	
	ПредставлениеПериода = Строка(ПериодОтчета);
	Элементы.ДекорацияПериод.Заголовок = ПредставлениеПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПериодНажатие(Элемент)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = ПериодОтчета;
	Если Диалог.Редактировать() Тогда 
    	ПериодОтчета = Диалог.Период;
	КонецЕсли;
	
	ОбновитьРасходЗаМесяц(Неопределено);
	
КонецПроцедуры


#КонецОбласти