
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРеквизитыДокументаПоШаблону(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьАвтораДокумента(ДокументОбъект);
	ЗаполнитьОтветственногоДокумента(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьАвтораДокумента(ДокументОбъект)
			
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Автор") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДокументОбъект.ЭтоНовый() Тогда
			
		ДокументОбъект.Автор = Пользователи.ТекущийПользователь();			
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтветственногоДокумента(ДокументОбъект)
			
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Ответственный") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ответственный) Тогда		
		ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти