
#Область ПрограммныйИнтерфейс

Процедура УстановитьЗначениеНастройкиВнешнейСистемы(Настройка, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	НастройкаОбъект = Настройка.ПолучитьОбъект();
	НастройкаОбъект[ИмяРеквизита] = ЗначениеРеквизита;
	НастройкаОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьДанныеПлатежей(Параметры) Экспорт
	
	ИменаПараметров = "ВнешняяСистема, ДатаНачала, ДатаОкончания";
		
	ПроверкаПараметров = мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.ПроверитьЗаполнениеПараметров(Параметры, ИменаПараметров);
	
	Если НЕ ПроверкаПараметров.Успех Тогда
		Возврат мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.РезультатСОшибкой(ПроверкаПараметров.ОписаниеОшибки);
	КонецЕсли;    
	
	СтатусСессии = мх_ИнтеграцияТинькоффКлиентСервер.СтатусСессии(Параметры.ВнешняяСистема);
	
	Если Не СтатусСессии.Успех Тогда
		Возврат мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.РезультатСОшибкой(СтатусСессии.ОписаниеОшибки);
	КонецЕсли;                                                                                                     
	
	УровеньДоступа = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтатусСессии, "accessLevel", Неопределено);
	
	Если УровеньДоступа <> "CLIENT" Тогда
		
		РезультатВхода = мх_ИнтеграцияТинькоффКлиентСервер.ВыполнитьВходВЛичныйКабинет(Параметры.ВнешняяСистема);
		
		Если НЕ РезультатВхода.Успех Тогда
			Возврат мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.РезультатСОшибкой(РезультатВхода.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;  
	
	Результат = мх_ИнтеграцияТинькоффКлиентСервер.ПолучитьДанныеПлатежей(Параметры);
	
	Если НЕ Результат.Успех Тогда
		Возврат Результат;
	КонецЕсли;  
	
	
	
КонецФункции

#КонецОбласти