
#Область ПрограммныйИнтерфейс

Процедура ЗагрузкаДанныхИзЛичныхКабинетовБанков(ИдентификаторыПлатежей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыПлатежей", ИдентификаторыПлатежей);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Ссылка КАК Ссылка,
	|	ВнешниеСистемы.ПометкаУдаления КАК ПометкаУдаления,
	|	ВнешниеСистемы.РегламентноеЗаданиеИспользуется КАК РегламентноеЗаданиеИспользуется,
	|	ВнешниеСистемы.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	Справочник.мх_ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ИдентификаторРегламентногоЗадания В(&ИдентификаторыПлатежей)";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Если Не Выборка.РегламентноеЗаданиеИспользуется Или Выборка.ПометкаУдаления Тогда
			ВызватьИсключение НСтр("ru = 'Внешняя система не используется'");
		КонецЕсли;

		Результат = ВыполнитьОбработкуИнтеграцииСВнешнейСистемой(Выборка.Ссылка);

		Если Не Результат.Успех Тогда
			ВызватьИсключение Результат.ОписаниеОшибки;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьОбработкуИнтеграцииСВнешнейСистемой(ВнешняяСистема)
	
	Результат = Новый Структура("Успех, ОписаниеОшибки", Истина, "");
	
	ТипВнешнейСистемы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешняяСистема, "ТипВнешнейСистемы");
	ТипыВнешнихСистем = Перечисления.мх_ТипыВнешнихСистем;
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	Если ТипВнешнейСистемы = ТипыВнешнихСистем.Тинькофф Тогда    
		
		Параметры = Новый Структура;
		Параметры.Вставить("ВнешняяСистема", ВнешняяСистема);
		Параметры.Вставить("ДатаНачала", НачалоДня(ТекущаяДата));
		Параметры.Вставить("ДатаОкончания", КонецДня(ТекущаяДата));
		
		Результат = мх_ИнтеграцияТинькофф.ПолучитьДанныеПлатежей(Параметры);
		
	ИначеЕсли ТипВнешнейСистемы = ТипыВнешнихСистем.Сбербанк Тогда
	Иначе
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Необрабатываемый тип внешней системы: %1'"), ТипВнешнейСистемы);
		Возврат мх_ИнтеграцияСВнешнимиСистемамиКлиентСервер.РезультатСОшибкой(ТекстОшибки, Результат);
	КонецЕсли;    
	
	Возврат Результат;
	
КонецФункции  

#КонецОбласти

