
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ГруппаОсновныеСтраницы.ТекущаяСтраница = Элементы.СтраницаРасходы;
	
	МассивДат = Объект.Расходы.Выгрузить(,"ДатаРасхода").ВыгрузитьКолонку("ДатаРасхода");
	МассивДатБезПовторов = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивДатБезПовторов, МассивДат, Истина);
	
	Если МассивДатБезПовторов.Количество() > 1 Тогда
		РасходЗаПериод = Истина;
	КонецЕсли;	
		
	УстановитьВидимостьКолонкиДатыРасхода();

КонецПроцедуры

&НаКлиенте
Процедура РасходЗаПериодПриИзменении(Элемент)
	УстановитьВидимостьКолонкиДатыРасхода();
	
	Если НЕ РасходЗаПериод Тогда
		
		Для каждого СтрокаТаблицы из Объект.Расходы Цикл
			СтрокаТаблицы.ДатаРасхода = Объект.Дата;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьКолонкиДатыРасхода()
	Элементы.РасходыДатаРасхода.Видимость = РасходЗаПериод;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для каждого СтрокаТаблицы из Объект.Расходы Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаРасхода) Тогда
			СтрокаТаблицы.ДатаРасхода = Объект.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



