
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ИмяТекущегоПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Код = &Код";
	Запрос.УстановитьПараметр("Код", ИмяТекущегоПользователя);
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если (Рез.Количество() = 0) Тогда
		ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	ИначеЕсли Рез.Количество() = 1 Тогда
		НайденныйПользователь = Рез[0].Пользователь;
		ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;		
	Иначе
		ВызватьИсключение "Найдено несколько пользователей с именем " + ИмяТекущегоПользователя;
	КонецЕсли;	
	
КонецПроцедуры
