#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанныеСеанса(ДанныеСеанса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеСеанса.Вставить("НомерСеанса"		, НомерСеансаИнформационнойБазы());
	ДанныеСеанса.Вставить("НомерСоединения"	, НомерСоединенияИнформационнойБазы());
	ДанныеСеанса.Вставить("Пользователь"	, ПараметрыСеанса.ТекущийПользователь);	
	
	РегистрыСведений.ДанныеСеансовИнформационнойБазы.ЗаписатьДанныеСеанса(ДанныеСеанса);
	
	УстановитьПривилегированныйРежим(Ложь);	

КонецПроцедуры

#КонецОбласти