
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьНадписьМесяцаПланирования();
	РассчитатьКоличествоДнейПериода();
	ПересчитатьБюджетНаДень();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПустаяСтрока(МесяцПланирования) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан месяц планирования",,"МесяцПланирования");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СуммаНакопленияПриИзменении(Элемент)
	ПересчитатьБюджетНаДень();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриИзменении(Элемент)
	ПересчитатьБюджетНаДень();
КонецПроцедуры

&НаКлиенте
Процедура РасходыПриИзменении(Элемент)
	ПересчитатьБюджетНаДень();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыСуммаПриИзменении(Элемент)
	ПересчитатьБюджетНаДень();
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаПриИзменении(Элемент)
	ПересчитатьБюджетНаДень();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбораПериода = Новый Структура("НачалоПериода,КонецПериода,ВыборКварталов",
	Объект.НачалоПериода, Объект.КонецПериода, Ложь);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц",
		ПараметрыВыбораПериода, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода,КонецПериода");
	УстановитьНадписьМесяцаПланирования();
	РассчитатьКоличествоДнейПериода();
	ПересчитатьБюджетНаДень();
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьМесяцаПланирования()
	
	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		МесяцПланирования = Строка(Формат(Объект.НачалоПериода, "ДФ='MMMM yyyy';"));
	Иначе
		МесяцПланирования = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличествоДнейПериода()
	ДнейВПериоде = (НачалоДня(Объект.КонецПериода) - НачалоДня(Объект.НачалоПериода)) / (60 * 60 * 24);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьБюджетНаДень()
	
	Если ДнейВПериоде = 0 Тогда
		Возврат;
	КонецЕсли;
		
	СуммаДоход = Объект.Доходы.Итог("Сумма");
	СуммаРасход = Объект.Расходы.Итог("Сумма");
	
	СвободныйОстаток = СуммаДоход - СуммаРасход - Объект.СуммаНакопления;
	
	СуммаБюджетНаДень = СвободныйОстаток / ДнейВПериоде;

	
КонецПроцедуры

#КонецОбласти

